Repository: common-repository/myfatoorah-api
Catalog: i18n/languages/myfatoorah-woocommerce-*.po
Languages: ar

source: Myfatoorah Payment Gateway for WooCommerce. Integrated with Myfatoorah DHL/Aramex Shipping Methods
ar: ماي فاتورة هي بوابة دفع خاصة للوكومرس. تدعم الشحن عن طريق الأرامكس وال DHL

source: MyFatoorah
ar: ماي فاتورة

source: Enable MyFatoorah
ar: تفعيل ماي فاتورة

source: This controls the title which the user sees during checkout.
ar: يتحكم هذا في العنوان الذي يراه المستخدم أثناء الدفع.

source: This controls the description which the user sees during checkout.
ar: يتحكم هذا في الوصف الذي يراه المستخدم أثناء الدفع.

source: Checkout with MyFatoorah Payment Gateway
ar: الدفع من خلال بوابة الدفع ماي فاتورة

source: Test Mode
ar: وضع الاختبار

source: Enable test / sandbox Mode
ar: تفعيل وضع الاختبار

source: Enable Test Mode
ar: تفعيل نظام الإختبار

source: API Key
ar: المفتاح الرمزي API

source: Get your API Token Key from Myfatoorah Vendor Account.
ar: احصل على رمز API الخاص بك من حساب ماي فاتورة.

source: List Payment Options
ar: قائمة خيارات الدفع

source: MyFatoorah is default gateway. You can select one of below payment gateway which the user can checkout directly from it.
ar: ماي فاتورة هي البوابة الافتراضية. يمكنك اختيار واحدة من بوابات الدفع أدناه والتي يمكن للمستخدم الدفع من خلالها مباشرة.

source: Myfatoorah Invoice Page (Redirect)
ar: إعادة التوجيه إلي صفحة ماي فاتورة للدفع

source: List All Enabled Gateways in Checkout Page
ar: سرد جميع طرق الدفع المفعلة في صفحة الدفع

source: How to mark the successful payment in the Admin Orders Page.
ar: تحديد حالة الطلبات الناجحة التي سوف تظهر في صفحة الطلبات في منصة الادمن.

source: Payment Success URL
ar: عنوان الرابط الخاص بنجاح الدفع

source: Please insert your Success url.
ar: الرجاء إدخال عنوان الرابط الخاص بصفحة اظهار بيانات عمليات الدفع الناجحة.

source: Payment Fail URL
ar: عنوان الرابط الخاص بفشل الدفع

source: Please insert your Fail url.
ar: الرجاء إدخال عنوان الرابط الخاص بصفحة اظهار بيانات عمليات الدفع الفاشلة.

source: Debug Mode
ar: تفعيل وضع التشخيص البرمجي

source: Log MyFatoorah events in
ar: تسجيل الأحداث الخاصة بماي فاتورة في ملف

source: Enable logging
ar: تفعيل التسجيل

source: MyFatoorah Logo URL
ar: عنوان الرابط الخاص بشعار الدفع

source: Please insert your logo url which the user sees during checkout.
ar: يرجى إدخال رابط الخاص بالشعار الذي يراه المستخدم في صفحه الدفع.

source: Enable MyFatoorah Shipping
ar: تفعيل الشحن عن طريق ماي فاتورة

source: Title to be display on site
ar: العنوان في الموقع

source: Myfatoorah Shipping
ar: شحن عن طريق ماي فاتورة

source: Enable DHL / Aramex
ar: تفعيل الشحن من خلال ماي فاوره

source: DHL / Aramex
ar: DHL / أرامكس

source: Exclude countries from shipping rates
ar: استبعاد البلدان من أسعار الشحن

source: Exclude countries from MyFatoorah shipping rates.
ar: استبعاد البلدان من أسعار الشحن في ماي فاتورة.

source: The Myfatoorah Gateway is simple and powerful. The plugin works by adding credit card fields on the checkout page, and then sending the details to myfatoorah for verification.
ar: بوابة ماي فاتورة بسيطة وفعالة، تعمل الإضافه عن طريق إضافة حقول بطاقة الائتمان في صفحة الخروج ، ثم إرسال التفاصيل إلى ماي فاتورة للتحقق منها.

source: Myfatoorah forces SSL checkout Payemnt. Your checkout is not secure! Please, contact site admin to enable SSL and ensure that the server has a valid SSL certificate.
ar: ماي فاتورة يفرض دفع SSL . تسجيل الخروج الخاص بك غير آمن! يرجى الاتصال بمسؤول الموقع لتمكين SSL والتأكد من أن الخادم لديه شهادة SSL صالحة.

source: Direct Payment Methods are not activated. Kindly, contact your MyFatoorah account manager or sales representative to activate it.
ar: لم يتم تفعيل طرق الدفع المباشر. يرجى الاتصال بمدير حساب ماي فاتورة أو مندوب المبيعات لتفعيله.

source: Card number is invalid.
ar: رقم البطاقة غير صالح.

source: Card security code is invalid (only digits are allowed).
ar: رمز أمان البطاقة غير صالح (يسمح فقط بالأرقام).

source: Card security code is invalid (wrong length).
ar: رمز أمان البطاقة غير صالح (طول خاطئ).

source: Card expiration date is invalid
ar: تاريخ انتهاء صلاحية البطاقة غير صالح

source: The Myfatoorah Gateway is simple and powerful. The plugin works by sending customers to Myfatoorah invoice page to enter their payment information.
ar: بوابة ماي فاتورة بسيطة وفعالة. يعمل المكون الإضافي عن طريق إرسال العملاء إلى صفحة فاتورة ماي فاتورة لإدخال معلومات الدفع الخاصة بهم.

source: Myfatoorah -
ar: ماي فاتورة -

source: Please, refund manually for this order
ar: الرجاء رد الأموال يدويًا لهذا الطلب

source: Myfatoorah refund completed. Refund Reference ID:
ar: اكتملت عملية الاسترداد. رقم الاسترداد المرجعي:

source: MyFatoorah DHL Shipping
ar: شحن عن طريق دي إتش إل

source: MyFatoorah Aramex Shipping
ar: شحن عن طريق أرامكس

source: Discount
ar: الخصم

source: Shipping
ar: الشحن

source: Fees
ar: الرسوم

source: MyFatoorah Shipping API Ver 2.0
ar: ماي فاتورة للشحن الاصدار الثاني

source: Custom Shipping Method for myfatoorah
ar: طريقة الشحن المخصصة لماي فاتورة

source: Kindly, review your Myfatoorah admin configuration due to a wrong entry to get Myfatoorah shipping cities.
ar: الرجاء التاكد من اعدادت ماي فاتورة في منصة الادمن حتي تستطيع الحصول على قائمة المدن الخاصة بالشحن.

source: Select Town / City
ar: اختار المدينة / القرية

source: Please make sure products have dimentions and wieght as well to get right Myfatoorah Shipping rates.
ar: الرجاء التاكد من ان سجل المنتجات يحتوي على بيانات الوزن والابعاد حتى تستطيع ماي فاتورة من حساب تكلفة الشحن.

source: View MyFatoorah documentation
ar: عرض وثائق ماي فاتورة

source: View MyFatoorah API docs
ar: عرض وثائق API الخاصة بماي فاتورة

source: Visit premium customer support
ar: قم بالاتصال بقسم الدعم الفني

source: Credit Card Type
ar: نوع بطاقة الائتمان

source: Card Holder Name
ar: إسم صاحب البطاقة

source: Credit Card Number
ar: رقم بطاقه الائتمان

source: Expiration Date
ar: تاريخ إنتهاء الصلاحية

source: 3 or 4 digits usually found on the signature strip.
ar: عادة ما توجد 3 أو 4 أرقام على شريط التوقيع.

source: Card Security Code
ar: رمز أمان الكرت
